import {FavouriteCircle} from "clicons-react";
import { Collapse } from 'antd';
import type { CollapseProps } from 'antd';

import styles from '../Posts.module.css';

function CollapseContent() {
  return (
    <div className={styles.siteInfo}>
      <p>[ІНФО (update)]: Проект уже краще підтримується мобільними пристроями, хоча, на вузьких екранах можуть бути
          проблеми.</p>

      <p>Варто зауважити, хоч цей клієнт і додає нові фішки, але також урізає деякі базові,
        існуючі на оригінальному сайті. Чому? - Проблема не в "поганому", чи недоробленому клієнті,
        просто розробники rule34.xxx банально не змогли зварганити адекватний API. <br/>
        Він без конкретних пояснень віддає:
        <br/> a) неповні дані - ті самі категорії тегів звичайно не отримуються простим способом, їх треба витягувати
        по одному, і кешувати самостійно, для стабільності апки. (По суті робити по одному запиту на кожен новий(не
        закешований) тег поста. І знаючи пости тут, вони мають і по 100+ тегів, а тепер глянь секцію нижче, де пише про
        ліміт запитів на API)
        <br/> б) багнуті дані - хотів отримати час написання коментаря? Отримуй час, коли був відправлений запит (X_X).
        <br/> І це далеко не всі приклади такого шлаку, зі сторони розробників..
        <br/> Загалом, просто побажаю всього найкращого всім, хто старався над цим прекрасним API, і за те, що мені
        прийшлося з ним мати справу. (Не побажаю нікому такого щастя)
      </p>

      <p>Додатково: в цьому клієнті жорстокий ліміт на 60запитів/хв(Звісно ви можете скорегувати це під себе, але
        більше запитів може спричинити бан акаунта, через ліміти сервіса.)</p>
      <p>Робота над проектом триває, а кожне оновлення робить його ще кращим. Дякую за інтерес до нього!</p>
    </div>
  );
}

const items: CollapseProps['items'] = [
  {
    key: '1',
    label: 'Більше інформації',
    children: <CollapseContent />,
  },
];


export const SiteInfo = () => (
  <div className={styles.siteInfo}>
    <img src="/rer34.png" alt="logo"/>
    <h1># Re:Rule34</h1>
    <p style={{color: 'grey'}}>*Фляско махає рукою всім відвідувачам сайту*</p>
    <p>Цей проект - повністю open-source вебсайт, який розробляється однією людиною. Він створений не як
      комерційний продукт, а як спроба переосмислити існуючий сервіс, зробивши його сучаснішим, зручнішим і
      приємнішим.</p>
    <p>В основі проекту лежить концепція оригінального <a href="https://rule34.xxx/">Rule34</a>, але з повністю
      переробленим підходом до взаємодії з сайтом. Мета - не просто повторити оригінал, а створити більш комфортну та
      функціональну альтернативу.</p>
    <p><FavouriteCircle/> Варто також віддати належне оригінальному Rule34. Саме його API використовується для
      отримання контенту, тому цей проєкт не існував би без їхньої роботи.</p>
    <p>Реалізовані фішки цього клієнту:</p>
    <ul>
      <li>Сучасний та адаптивний інтерфейс</li>
      <li>Приємні анімації</li>
      <li>Відсутність реклами</li>
      <li>Зручніший пошук по тегах</li>
      <li>Влаштований зручний переглядач медіа</li>
      <li>Краще відображення інформації по постам</li>
      <li>+ Унікальний пред-перегляд довжини відео</li>
      <li>+ Пред-перегляд повної версії прев'ю поста (Зажати картинку)</li>
      <li>Розумна та зручна система пагінації сторінок постів</li>
      <li>Детальні налаштування клієнту</li>
      <li>+ Незвичайні фан-налаштування, які роблять перегляд цікавішим</li>
      <li>Система фільтрації потенційно неприємних тем</li>
      <li>Налаштування пошуку, для найкращого досвіду</li>
      <li>Проста система зберігання постів в колекції</li>
    </ul>
    <Collapse ghost items={items} style={{ width: '100%' }} />
    <p className={styles.version}>Made with love, by BattWrku • v{__APP_VERSION__}</p>

  </div>
);